Repository: Mohamed372-hue/flutter_localization_test
Catalog: lib/l10n/intl_*.arb
Languages: ar

# title
source: Today's quotes
ar: نصيحة اليوم

# q1
source: The best way to predict the future is to create it.
ar: أفضل طريقة للتنبؤ بالمستقبل هي أن تخلقه.

# q2
source: Success is not final, failure is not fatal: It is the courage to continue that counts.
ar: النجاح ليس نهائيًا، والفشل ليس مميتًا: الشجاعة في المضي قدمًا هي ما يهم.

# q3
source: Believe you can and you're halfway there.
ar: آمن بأنك تستطيع وسوف تكون على نصف الطريق.

# q4
source: You donâ€™t have to be great to start, but you have to start to be great.
ar: لا تحتاج إلى أن تكون عظيمًا لتبدأ، ولكن عليك أن تبدأ لتكون عظيمًا.

# q5
source: The only way to do great work is to love what you do.
ar: الطريقة الوحيدة للقيام بعمل عظيم هي أن تحب ما تفعل.

# q6
source: In the middle of every difficulty lies opportunity.
ar: في وسط كل صعوبة يكمن الفرصة.

# q7
source: Your time is limited, so don't waste it living someone else's life.
ar: وقتك محدود، لذا لا تضيعه في عيش حياة شخص آخر.

# q8
source: The journey of a thousand miles begins with one step.
ar: رحلة الألف ميل تبدأ بخطوة واحدة.

# q9
source: It is never too late to be what you might have been.
ar: ليس هناك وقت متأخر أبدًا لتكون ما كنت قد تكونه.

# q10
source: The future belongs to those who believe in the beauty of their dreams.
ar: المستقبل ينتمي إلى أولئك الذين يؤمنون بجمال أحلامهم.
